Repository: T3Voila/templavoilaplus
Catalog: Resources/Private/Language/*.BackendLayout.xlf
Languages: de

# mlang_tabs_tab
source: Page
de: Seite

# mlang_labels_tabdescr
source: This module allows you to create and edit webpages. It provides a template selector and management for different languages. This page module is part of the extension "TemplaVoilà Plus".
de: Dieses Modul erlaubt es, Seiten zu erzeugen und zu bearbeiten. Es stellt eine Template-Auswahl bereit und erlaubt die Verwaltung unterschiedlicher Übersetzungen. Dieses Seiten-Modul ist Teil der Extension "TemplaVoilà Plus".

# mlang_labels_tablabel
source: Create and edit pages
de: Seite erzeugen und bearbeiten

# title
source: WEB > PAGE MODULE
de: MODUL WEB > SEITE

# default_introduction
source: If you wish to edit the content of a page, please click the page title in the page tree to the left.
de: Wenn Sie den Inhalt einer Seite bearbeiten möchten, klicken Sie bitte im Seitenbaum auf der linken Seite auf einen Seitentitel.

# csh_whatisthetemplavoilapagemodule
source: What is the TemplaVoilà page module?
de: Was ist das TemplaVoilà-Seitenmodul?

# createnewpage_selecttemplate
source: Select a template for your new page:
de: Vorlage für die neue Seite auswählen:

# createnewpage_defaultlayoutsubmitlabel
source: Create page with default layout
de: Neue Seite mit Standardlayout erstellen

# createnewpage_templateobject_createemptypage
source: Create an empty page based on this template:
de: Eine leere Seite basierend auf folgender Vorlage erstellen:

# createnewpage_templateobject_createpagewithdefaultcontent
source: Create a page with default content based on this template:
de: Eine Seite mit vorausgefülltem Inhalt, basierend auf folgender Vorlage erstellen:

# createnewcontent_newContentElement
source: New content element
de: Neues Inhaltselement

# info_elementfromotherpage
source: This is a reference to an element on page %2$d.
de: Dies ist eine Referenz zu einem Element auf Seite %2$d.

# warning_elementusedmorethanonce
source: This element has been used %s times on this page! ID:%s
de: Dieses Element wird auf der aktuellen Seite %s mal verwendet! ID:%s

# warning_containerSeparate
source: This container element has localization without inheritance enabled (langChildren = 0). This is most likely a misconfiguration since the localization features of TemplaVoilà does not support localized container fields in the native interface! Please inform the system administrator!
de: ACHTUNG: Für dieses Container-Element wurde Lokalisierung ohne Vererbung aktiviert (langChildren = 0). Dabei handelt es sich vermutlich um eine Fehlkonfiguration, weil die Standardoberfläche von TemplaVoilà die Darstellung lokalisierter Container-Felder nicht unterstützt! Bitte informieren Sie den Systemadministrator!

# warning_containerInheritance
source: This container element has localization enabled but with inheritance (langChildren = 1). This situation might produce confusing displays in TemplaVoilà and you are encouraged to disable localization of this container element completely by setting langDisable = 1. Please inform the system administrator!
de: Für dieses Container-Element wurde Lokalisierung mit Vererbung aktiviert (langChildren = 1). Diese Konfiguration kann zu verwirrenden Darstellungen in TemplaVoilà führen, und es wird empfohlen, die Lokalisierung für dieses Container-Element komplett auszuschalten, indem Sie langDisable auf "1" setzen. Bitte informieren Sie den Systemadministrator.

# warning_containerSeparate_short
source: L10N mode: Separate!
de: Übersetzungsmodus: Separat!

# warning_containerInheritance_short
source: L10N mode: Inheritance
de: Übersetzungsmodus: Vererbung

# cannotedit_doktypemountpoint
source: This page acts as a mount point and its content is being replaced by another page ("%s"). Therefore you cannot edit the content of this page directly.
de: Diese Seite dient als Freigabe und ihr Inhalt wird durch den einer anderen Seite ("%s") ersetzt. Sie können den Inhalt dieser Seite daher nicht direkt bearbeiten.

# jumptomountsourcepage
source: Jump to source page of this mount point
de: Springe zur Ursprungsseite für diese Freigabe

# cannotedit_contentfrompid
source: This page has been configured in a way that it doesn't have any content itself but instead the content of another page ("%s") is shown. Therefore you cannot edit the content of this page directly.
de: Diese Seite wurde so konfiguriert, dass sie selbst keine Inhalte enthält, sondern stattdessen die Inhalte einer anderen Seite ("%s") anzeigt. Daher können Sie den Inhalt dieser Seite nicht direkt bearbeiten.

# jumptocontentfrompidpage
source: Jump to page containing the content elements
de: Springe zur Seite, die die Inhaltselemente enthält.

# cannotedit_shortcut_0
source: This page is of the type "shortcut". Instead of having content on its own, this page shows the content the page "%s". Therefore you cannot edit the content of this page directly.
de: Diese Seite ist vom Typ "Verweis" und enthält keinen eigenen Inhaltselemente. Stattdessen wird der Inhalt der Seite "%s" angezeigt. Daher können Sie den Inhalt dieser Seite nicht direkt bearbeiten.

# cannotedit_shortcut_1
source: This page is of the type "shortcut". Instead of having content on its own, this page shows the content from the first sub page. Therefore you cannot edit the content of this page directly.
de: Diese Seite ist vom Typ "Verweis" und enthält keinen eigenen Inhaltselemente. Stattdessen wird der Inhalt der ersten Unterseite angezeigt. Daher können Sie den Inhalt dieser Seite nicht direkt bearbeiten.

# cannotedit_shortcut_2
source: This page is of the type "shortcut". Instead of having content on its own, this page shows the content of a random sub page. Therefore you cannot edit the content of this page directly.
de: Diese Seite ist vom Typ "Verweis" und enthält keinen eigenen Inhaltselemente. Stattdessen wird der Inhalt einer zufälligen Unterseite angezeigt. Daher können Sie den Inhalt dieser Seite nicht direkt bearbeiten.

source: Jump to shortcut destination
de: Springe zum Ziel des Verweises

# cannotedit_externalurl_1
source: This page refers to an external website, you therefore cannot edit the content of this page directly.
de: Diese Seite verweist auf eine externe Web-Site. Daher können Sie den Inhalt dieser Seite nicht direkt bearbeiten.

# cannotedit_externalurl_2
source: This page refers to an external FTP location, you therefore cannot edit the content of this page directly.
de: Diese Seite verweist auf einen FTP-Server. Daher können Sie den Inhalt dieser Seite nicht direkt bearbeiten.

# cannotedit_externalurl_3
source: This page refers to an email address, you therefore cannot edit the content of this page directly.
de: Diese Seite verweist auf eine E-Mail-Adresse. Daher können Sie den Inhalt dieser Seite nicht direkt bearbeiten.

# jumptoexternalurl
source: Jump to external URL (%s)
de: Zu externer URL springen (%s)

# editpage_sysfolder_intro
source: The current page is of the type "Sysfolder". Sysfolders usually don't contain content elements but are used for collecting other types of records in a single folder.
de: Die aktuelle Seite ist vom Typ "Systemordner". Systemordner enthalten üblicherweise keine Inhaltselemente, sondern werden zur Ablage anderer Arten von Datensätzen verwendet.

# editpage_sysfolder_listview_noaccess
source: The content of a Sysfolder is usually managed by the "List" module but you currently don't have access to that module. If you need to access the data in the Sysfolder anyway, please ask your system administrator to grant you access to the List module.
de: Der Inhalt eines Systemordners wird normalerweise über das Modul "Liste" verwaltet. Zur Zeit haben Sie jedoch keinen Zugriff auf dieses Modul. Wenn Sie dennoch auf die Daten in diesem Systemordner zugreifen möchten, bitten Sie Ihren Systemadministrator, Ihnen Zugriff auf das Modul "Liste" zu gewähren.

# editpage_sysfolder_switchtolistview
source: Switch to list view
de: Zur Listenansicht wechseln

# template_nodescriptionavailable
source: No description available.
de: Keine Beschreibung verfügbar.

# template_titledefault
source: Default template
de: Standardvorlage

# template_titleInherit
source: No selection (inherit)
de: Keine Auswahl (Vererbung)

# willbereplacedbydefaultlanguage
source: (will be replaced by content of default language)
de: (wird durch Inhalt der Standardsprache ersetzt)

# newce_defaulttext_text
source: Please enter some text here
de: Bitte geben Sie hier Text ein

# view_basic
source: Basic view
de: Standardansicht

# view_tree
source: Tree view
de: Baumstruktur

# createnewtranslation
source: Create new page translation
de: Neue Seitenübersetzung anlegen

# selectlanguageversion
source: Show page language version
de: Ausgewählte Sprache

source: Page localization mode
de: Übersetzungsmodus der Seite

# pageLocalizationMode_separate
source: Separate structures
de: Separate Strukturen

# pageLocalizationMode_inheritance
source: Inheritance of values
de: Vererbung der Werte

# pageLocalizationMode_inheritance.disableInheritance
source: Don't inherit structure
de: Struktur nicht vererben

# pageLocalizationDisplayMode
source: Display mode
de: Darstellungsmodus

# pageLocalizationDisplayMode_selectedLanguage
source: Selected language
de: Ausgewählte Sprache

# pageLocalizationDisplayMode_onlyLocalized
source: Only localized elements
de: Nur übersetzte Elemente

source: Click to edit translation
de: Zum Bearbeiten der Übersetzung klicken

# editlanguageversion
source: Edit page properties
de: Seiteneigenschaften bearbeiten

source: Multiple languages
de: Mehrere Sprachen

source: Language disabled
de: Sprache deaktiviert

source: View sub elements
de: Unterelemente anzeigen

# gobacktooverview
source: Go back to whole page view
de: Zurück zur Ansicht der ganzen Seite

# createnewrecord
source: Create new element
de: Neues Element anlegen

# editrecord
source: Edit element
de: Element bearbeiten

# editrecord_d
source: Editing is not allowed for this element!
de: Bearbeiten dieses Elements ist nicht erlaubt!

# pasterecord
source: Paste element
de: Element einfügen

# pastefce_andcopyallsubs
source: Paste copy of element and make copies of all sub elements
de: Kopie des Elements mit Kopien aller Unterelemente einfügen

# pastefce_andreferencesubs
source: Paste copy of element and keep references to original sub elements
de: Kopie des Elements mit Verknüpfung zu den ursprünglichen Unterelementen einfügen

# copyrecord
source: Copy element
de: Element kopieren

# cutrecord
source: Cut element
de: Element ausschneiden

source: Create reference
de: Verknüpfung erstellen

# unlinkRecord
source: Unlink element
de: Verknüpfung entfernen

# deleteRecord
source: Delete element (!)
de: Element löschen(!)

# deleteRecordMsg
source: Do you really want to delete this element?
de: Dieses Element tatsächlich löschen?

# deleteRecordWithReferencesMsg
source: This element is also referenced on other pages. Do you really want to delete this element?
de: Auf dieses Element wird auf anderen Seiten verwiesen. Dieses Element tatsächlich löschen?

# unlinkRecordMsg
source: Unlink element?
de: Verknüpfung für diese Element lösen?

source: Page related information
de: Seitenbezogene Informationen

source: Advanced functions
de: Erweiterte Funktionen

# localization
source: Translations
de: Übersetzungen

# availabletranslations
source: Translations
de: Übersetzungen

source: Versioning
de: Versionierung

source: Non-used elements
de: Nicht verwendete Elemente

# makeLocal
source: Create local copy
de: Lokale Kopie erstellen

# makeLocalMsg
source: Do you want to create a local copy of this referenced element?
de: Eine lokale Kopie dieses verknüpften Elements erstellen?

# performTranslation
source: Click to translate FlexForm
de: Klicken um FlexForm zu übersetzen

source: Path
de: Pfad

source: Default language
de: Standardsprache

# createcopyfortranslation
source: Create a copy for translation
de: Kopie für Übersetzung erstellen

# inititemno_elementsNotBeingUsed
source: Elements not being used in this language or sheet
de: Elemente, die in diesem Blatt oder Sprache nicht verwendet werden

# rendernonusedelements_deleteall
source: Delete all records above marked with delete-icon
de: Alle obigen mit einem Löschen-Symbol gekennzeichneten Datensätze löschen

# renderreferencecount_delete
source: Delete!
de: Löschen!

# sidebar_advancedfunctions_labelshowhidden
source: Show hidden elements
de: Verborgene Elemente anzeigen

# sidebar_advancedfunctions_labelshowoutline
source: Show outline
de: Listendarstellung anzeigen

# sidebar_advancedfunctions_labelcachefunctions
source: Cache functions
de: Cache-Funktionen

# sidebar_renderitem_showtranslationinformation
source: Display translation information
de: Übersetzungsinformationen anzeigen

# sidebar_versionSelector
source: Versioning
de: Versionierung

# sidebar_versionSelector_createVersion
source: Create version of this page
de: Version dieser Seite erstellen

# outline_header_title
source: Title:
de: Titel:

# outline_header_controls
source: Controls:
de: Bedienungselemente:

# outline_status_dirty
source: Click to clean up XML...
de: Zum Bereinigen des XML klicken...

# outline_status_clean
source: XML is clean.
de: XML ist sauber.

# outline_status_cleanAll
source: Clean XML of all dirty elements above!
de: XML um alle obigen Elemente bereinigen!

# element_localizations
source: Localizations
de: Übersetzungen

# records
source: Other elements (non-content)
de: Andere Elemente (Nicht-Inhalt)

# displayRecordsFrom
source: Display elements from:
de: Elemente anzeigen von:

# content_from_pid_title
source: Page uses content from this page: %s
de: Seite verwendet Inhalt dieser Seite: %s

# missing_edit_right
source: Your user settings don't allow creating, moving or removing elements from this page.
de: Die Benutzereinstellungen erlauben kein Erzeugen, Verschieben oder Entfernen von Elementen auf dieser Seite.

# missing_edit_right_detail
source: Your settings indicate that you're either don't have the general right to edit page content, or you're not allowed to modify required tables or you're not allowed to edit the content fields. We suggest you recheck the settings or get in touch with your technical support.
de: Die Benutzereinstellungen deuten darauf hin, dass das allgemeine Recht zur Bearbeitung von Seiteninhalten nicht vorliegt, die benötigten Tabellen oder die Inhaltsfelder nicht bearbeitet werden dürfen. Bitte Einstellungen prüfen und ggf. mit dem Administrator Kontakt aufnehmen.

# maximal_content_elements
source: The maximal amount of %d content elements is reached in field "%s."
de: Höchstanzahl von %d Inhaltselementen im Feld "%s" erreicht.

# page_structure_inherited
source: The content structure for this lanuage differs from the default language.
de: Die Inhaltsstruktur für diese Sprache unterscheidet sich von der Standardstruktur der Sprache.

# page_structure_inherited_detail
source: If that's not what you expect, please contact you content administrator.
de: Sofern Sie dies nicht erwartet haben, informieren Sie bitte den Administrator.

# page_not_found
source: The requested page can't be found or is not accessible.
de: Die gesuchte Seite wurde nicht gefunden oder Sie haben keinen Zugriff!.
