Repository: T3Voila/templavoilaplus
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# cm1_viewsubelements
source: View: Sub elements
de: Ansicht: Unterelemente

# cm1_viewflexformxml
source: View: Flexform XML
de: Ansicht: Flexform-XML

# cm_viewdsto
source: View: DS/TO
de: Ansicht: DS/TO

# cm1_pagesusingthiselement
source: Pages using this element ->
de: Seiten, die dieses Element nutzen ->

# wiz_refElements
source: Reference unused content elements (templavoila)
de: Unbenutzte Inhaltselemente referenzieren (TemplaVoilà)

# wiz_renameFieldsInPage
source: Rename a field in pages.tx_templavoila_flex
de: Feld in pages.tx_templavoila_flex umbenennen

# field_sourceField
source: source field
de: Quellfeld

# field_destinationField
source: destination field
de: Zielfeld

# field_simulateField
source: Simulate Change only
de: Änderung nur simulieren

# field_submit
source: submit
de: Absenden

# extconf.staticWizard.header
source: Migrate
de: Migrieren

# extconf.staticWizard.message
source: Please use the migration wizard to move all datastructures from your database to the filesystem.
de: Bitte nutzen Sie den Migrations-Assistenten, um alle Datenstrukturen von der Datenbank in das Dateisystem zu verschieben.

# extconf.staticWizard.link
source: Click here to run the wizard
de: Klicken Sie hier um den Assistenten zu starten
