Repository: T3Voila/templavoilaplus
Catalog: Resources/Private/Language/*.locallang_csh_module.xlf
Languages: de

# .alttitle
source: TemplaVoilà Mapping
de: TemplaVoilà-Verknüpfung

# mapping_file.description
source: Modify the structure of this Template and map it with a certain HTML.
de: Die Struktur dieser Vorlage ändern und sie mit HTML verknüpfen.

# mapping_file_showXMLDS.description
source: This view shows the "source code" of what is built together for the Data Structure. You can later modify this data manually.
de: Diese Ansicht zeigt den "Quellcode" der Zusammenstellung für die Datenstruktur. Sie können diese Daten später manuell ändern.

# mapping_file_loadDSXML.description
source: On this page, you can select to load an existing XML (either through an existing Data Structure or through a simple copy / paste of XML in the area below, to replace the existing data structure.
de: Auf dieser Seite können Sie eine bestehende XML-Datei laden, um die bestehende Datenstruktur zu ersetzen (entweder über eine bestehende Datenstruktur oder mit einfachem Kopieren und Einfügen des XML-Codes in den unten stehenden Bereich).

# mapping_file_createDSTO.description
source: Add the Data Structure and Template Object (TemplaVoilà will create both of them for you) to a certain Storage Folder. Please be aware that you have to have an existing Storage Folder in your page tree to select it from the dropdown. If you choose "Page Template" as the "Template Type", the new DS/TO Combo will appear when you edit the page properties. If you select "Content Element", the new TO will appear as a new content element type option when you add a new Content Element within any page.
de: Hinzufügen der Datenstruktur und des Vorlagenobjekts zu einem bestimmten Speicherordner (TemplaVoilà erstellt beide für Sie). Bitte beachten Sie, dass ein Speicherordner in Ihrem Seitenbaum existieren muss, damit Sie ihn im Auswahlmenü wählen können. Wenn Sie "Seitenvorlage" wählen, wird die neue Datenstruktur-/Vorlagenobjekt-Kombination angezeigt, wenn Sie die Seiteneigenschaften bearbeiten. Wenn Sie "Inhaltselement" wählen, wird das neue Vorlagenobjekt als neuer Inhaltselementtyp erscheinen, sobald Sie ein neues Inhaltselement zu einer Seite hinzufügen.

# mapping_to.description
source: This tab shows a list of the Template Object (TO), the file and the correspondig Data Structure (DS)
de: Dieser Reiter zeigt eine Liste aus dem Vorlagenobjekt (VO), der Datei und der entsprechenden Datenstruktur (DS).

# mapping_to_modifyDSTO.description
source: If you need to modify the structure (the DS that is), e.g. add a new Data Element (a "field") or change the behaviour of a certain Data Element, click here. However, be aware that this modification will erase any custom modification you made to the XML.
de: Klicken Sie hier, falls Sie die Datenstruktur ändern müssen, also zum Beispiel ein neues Datenelement (ein "Feld") hinzufügen oder das Verhalten eines bestimmten Datenelements ändern möchten. Beachten Sie jedoch, dass dies alle Änderung, die Sie am XML-Code vorgenommen haben, löschen wird.

# mapping_head_mapping_instructions.description
source: Additional information for each Data Element and what you have to consider when you map the Data Element to a HTML tag.
de: Zusätzliche Informationen für jedes Datenelement und was Sie zu beachten haben wenn Sie das Datenelement mit einem HTML-Tag verknüpfen.

# mapping_head_sample_data.description
source: The sample data that is used for the preview (see button below).
de: Die Beispieldaten die für die Vorschau genutzt werden (siehe Schaltfläche unten).

# mapping_head_dataElement.description
source: A hierarchical list of all Data Elements ("fields") in this Template Object.
de: Eine hierarchische Liste aller Datenelemente ("Felder") in diesem Vorlagenobjekt.

# mapping_head_Field.description
source: "ROOT" is the main container where everything else is stored. The others are the field names.
de: "ROOT" ist der Hauptcontainer in dem alles andere gespeichert wird. Die anderen Werte sind die Feldnamen.

# mapping_head_HTMLpath.description
source: Displays the HTML element that is mapped to. Hover over the HTML tag to see the full path inside the XML structure. "OUTER" means that the mapping will also replace the element that the field is mapped to, "INNER" means that the content of the element will be replaced, the element itself will be kept.
de: Zeigt das verknüpfte HTML-Element an. Halten sie den Mauszeiger über den HTML-Tag um den vollständigen Pfad innerhalb der XML-Struktur zu sehen. "OUTER" bedeutet, dass die Verknüpfung auch das Element ersetzt, auf welches das Feld verweist; "INNER" bedeutet, dass der Inhalt des Elements ersetzt wird, das Element selbst aber erhalten bleibt.

# mapping_head_Action.description
source: "Map" / "Re-Map" allows you to map the field to a certain HTML tag within your HTML file. Use "Ch.Mode" if you only need to modify the OUTER and INNER option.
de: Zeigt das verknüpfte HTML-Element an. Halten Sie den Mauszeiger über das HTML-Tag um den vollständigen Pfad innerhalb der XML-Struktur zu sehen. "OUTER" bedeutet, dass die Verknüpfung auch das Element ersetzt, auf welches das Feld verweist; "INNER" bedeutet, dass der Inhalt des Elements ersetzt wird, das Element selbst aber erhalten bleibt.

# mapping_head_Rules.description
source: Shows additional mapping restrictions (e.g. only map to a specific HTML tag) for a field. This is defined in the Data Structure.
de: Zeigt weitere Verknüpfungsbeschränkungen für ein Feld an (z.B. ein Feld nur an einen bestimmten HTML-Tag verknüpfen). Diese sind in der Datenstruktur definiert.

# mapping_head_Edit.description
source: Change the details of a Data Element or delete it completely from the data structure.
de: Die Details eines Datenelements ändern oder es komplett aus der Datenstruktur entfernen.

# mapping_window_modes.description
source: "Exploded Visual" display a view of the HTML template as it looks like (with all the styles), whereas "HTML Source" displays the pure XML structure in a hierarchical source view.
de: "Explosions-Ansicht" zeigt eine Ansicht der HTML-Vorlage an, wie sie mit allen Stilen aussieht, während "HTML Quellcode" die reine XML-Struktur in einer hierarchischen Quellcode-Ansicht zeigt.

# mapping_window_help.description
source: In the screen below you'll see the composite work of the plain HTML template, where the mapped HTML tags are replaced with the sample data (if available).
de: Auf der unteren Anzeige sehen Sie die Zusammenstellung der reinen HTML-Vorlage in der die verknüpften HTML-Tags mit den Beispieldaten (falls vorhanden) verknüpft sind.

# mapping_basics.description
source: This screen basically allows you to create certain structure through adding fields (when creating the Data Structure) and then map these fields to HTML tags within a HTML template.
de: Diese Anzeige erlaubt Ihnen eine gewisse Struktur zu erstellen indem Sie Felder hinzufügen (wenn Sie die Datenstruktur erstellen) und diese Felder mit HTML-Tags in einer HTML-Vorlage verknüpfen.

# mapping_to_headerParts.description
source: When adding a new page template, the Mapping (see other tab) only works on the <body> tag, if you need to add other HTML tags from the HTML <head> tag, you can do this on this screen. Please make sure to hit the "Set" button on the bottom of this list to save your changes. Additional tags in the head part of your HTML can of course be added via regular TypoScript.
de: Wenn eine neue Seitenvorlage hinzugefügt wird funktioniert das Verknüpfen (siehe anderer Reiter) nur innerhalb des <body>-Tags. Wenn Sie andere HTML-Tags aus dem <head>-Bereich hinzufügen möchten können sie dies hier tun. Bitte stellen Sie sicher, dass Sie den "Set"-Knopf am Ende dieser Liste drücken um Ihre Änderungen zu speichern. Zusätzliche Tags im <head>-Bereich Ihrer HTML-Datei können natürlich mit normalem TypoScript hinzugefügt werden.

# mapping_to_headerParts_buttons.description
source: Press "Clear All" to unset all checkboxes above; "Set" saves the changes of this page (the additional tags), "Save" writes the changes of the Mapping (see other tab) to the database. "Save and return" also writes the mapping to the database, but will also return to the TemplaVoilà Control Center.
de: Drücken Sie "Alles entfernen" um alle Kontrollkästchen abzuwählen. "Festlegen" speichert die Änderungen auf dieser Seite (die zusätzlichen Tags). "Speichern" schreibt die Änderungen der Verknüpfungen (siehe anderer Reiter) in die Datenbank. "Speichern und zurück" schreibt die Verknüpfungen ebenfalls in die Datenbank und wechselt danach automatisch zum TemplaVoilà Kontrollzentrum.

# mapping_editform.description
source: Select the Mapping Type, a distinguishable name, instructions for the one who will map the data to a HTML template later on (optional). The Editing Type determines how the data on the field should be entered. Mapping rules allow to only map to certain HTML tags or HTML attributes. "a:attr:href" to only allows mapping to href attributes of HTML anchor tags.
de: Wählen Sie den Verknüpfungstyp, einen eindeutigen Namen, und (optional) Anweisungen für denjenigen der später die Daten mit einer HTML-Vorlage verknüpfen wird. Die Bearbeitungsart bestimmt wie die Daten in das Feld eingegeben werden sollen. Verknüpfungsregeln ermöglichen die Verknüpfung auf bestimmte HTML-Tags oder HTML-Attribute zu begrenzen. "a:attr.href" erlaubt ausschließlich das Verknüpfen von HTML-Anker-Tags.

# mapping_addfield.description
source: Enter a for this data structure unique string and click "Add field" to get to the detailed form for this new field.
de: Geben Sie einen eindeutigen Namen für diese Datenstruktur an und klicken Sie "Feld hinzufügen" um zum Detail-Eingabefeld für dieses neue Feld zu wechseln.

# mapping_modeset.description
source: "OUTER" means that the mapping will also replace the element that the field is mapped to, "INNER" means that the content of the element will be replaced, the element itself will be kept.
de: "OUTER" bedeutet, dass die Verknüpfung auch das Element ersetzt, auf welches das Feld verweist; "INNER" bedeutet, dass der Inhalt des Elements ersetzt wird, das Element selbst aber erhalten bleibt.

# mapping_ds.description
source: The list above is the full representation of all fields, containers and sections within this Data Structure.
de: Die obige Liste ist die vollständige Auflistung aller Felder, Container und Abteilungen innerhalb dieser Datenstruktur.

# mapping_ds_to.description
source: The above lists all Template Objects that use this Data Structure.
de: Die obige Liste beinhaltet alle Vorlagenobjekte welche diese Datenstruktur nutzen.

# mapping_ds_showXML.description
source: The XML code above is the complete source of the Data Structure, and how it's stored in the database.
de: Der obige XML-Code ist der komplette Quellcode der Datenstruktur und seiner Speicherart in der Datenbank.
