Repository: T3Voila/templavoilaplus
Catalog: Resources/Private/Language/*.locallang_csh_pm.xlf
Languages: de

# pagemodule.alttitle
source: Page Module (TemplaVoilà)
de: Seitenmodul (TemplaVoilà)

# pagemodule.description
source: The TemplaVoilà Page Module lets you easily edit content of your web page. You see the content fitted according to the layout of how it is displayed in the frontend.
de: Das TemplaVoilà-Seitenmodul erlaubt das einfache Bearbeiten von Inhalten auf Ihrer Website. Sie sehen Inhalte so gemäß Inhalt platziert, wie diese auch im Frontend ausgegeben werden.

# pagemodule_notUsed.description
source: Lists all elements that are added but not visually linked (and therefore not displayed) to this page. Usually these elements were unlinked (using the trash icon below) but are not completely deleted yet. Once you are sure
de: Zeigt alle Elemente an die hinzugefügt wurden, aber nicht visuell verknüpft sind (und daher nicht angezeigt werden). Ein häufiger Grund ist, dass die Verknüpfung dieser Elemente entfernt wurde (mit dem Papierkorb-Icon unten) aber die Elemente noch nicht vollständig gelöscht sind. Wenn Sie sicher sind, dass diese Elemente nicht mehr benötigt werden, können Sie sie löschen.

# selectlanguageversion.description
source: By selecting a specific language, you can narrow down the output of the page module. Use this option in conjunction with the display mode option 'Selected Language' below.
de: Indem Sie eine bestimmte Sprache wählen, können Sie die Ausgabe des Seitenmoduls eingrenzen. Nutzen Sie diese Option in Verbindung mit der Anzeigeart-Option "gewählte Sprache" weiter unten.

# editlanguageversion.description
source: Every translation of a page has its own page title, keywords or other meta information. Click on the corresponding flag to edit this information for a specific language. If a flag of a translation that you want to translate does not show up, you maybe need to create a new translation first.
de: Jede Übersetzung einer Seite hat ihren eigenen Seitentitel, Schlagwörter und andere Metainformationen. Klicken sie auf die entsprechende Flagge um diese Informationen für einen bestimmte Sprache zu bearbeiten. Falls eine Flagge für eine gewünschte Übersetzungssprache nicht aufgelistet ist müssen Sie vielleicht zuerst eine neue Übersetzung erstellen.

# createnewtranslation.description
source: Select the appropriate flag to create a new translation for this page. Once the language is added, you can translate the page properties and start translating the page content of the original page.
de: Wählen Sie die passende Flagge aus, um eine neue Übersetzung für diese Seite zu erstellen. Sobald die Sprache hinzugefügt wurde, können Sie die Seiten-Eigenschaften übersetzen und anfangen, den Seiteninhalt der Ursprungsseite zu übersetzen.

# pagelocalizationmode.description
source: You can see here how the page is localized. Translations either allow separate structures (more flexible) or stick to a 1:1 translation (only translate elements in the default language). This setting is defined in the Data Structure source of the Page Template.
de: Hier sehen Sie auf welche Art die Seite lokalisiert ist. Übersetzungen sind entweder getrennte Strukturen (flexibler) oder halten sich an eine 1:1 Übersetzung (übersetzt nur Elemente in der Standardsprache). Diese Einstellung ist in der Datenstruktur-Quelle der Seitenvorlage definiert.

# pagelocalizationdisplaymode.description
source: The display mode lets you switch between displaying all languages, only the selected language that you chose in the select box above, or only the elements that were translated already. Where the first option gives you a nice overview of all elements that are translated yet, you can focus on one language by displaying only the selected translation page and / or elements.
de: Der Anzeigemodus ermöglicht es Ihnen alle Sprachen, nur die im obigen Auswahlfeld gewählte Sprache oder nur die bereits übersetzten Elemente anzuzeigen. Die erste Option gibt Ihnen einen gute Übersicht aller bereits übersetzten Elemente. Sie können sich auf eine Sprache konzentrieren indem Sie nur die gewählte Übersetzungsseite und/oder Elemente anzeigen.

# disablePageStructureInheritance.description
source: The inheritance mode enables various options for the page-structure handling. The default setting is to inherit the structure from the default language. but you're free to create your own element structure just enable the checkbox.
de: Der Vererbungsmodus aktiviert verschiedene Optionen für die Handhabung der Seitenstruktur. In der Standardeinstellung wird die Struktur von der Standardsprache geerbt. Sie können aber auch Ihre eigene Elementstruktur erstellen, indem Sie das Kontrollkästchen aktivieren.

# advancedfunctions_showhiddenelements.description
source: Enabling this option also displays the content elements that are hidden in the
de: Auch versteckte Inhaltselemente anzeigen.

# advancedfunctions_showoutline.description
source: This display mode shows the data structures of the elements that are used in this page. It is mainly used for administration purposes and to clean up the XML if something went wrong on this page.
de: Dieser Anzeigemodus zeigt die Datenstruktur der Elemente, welche auf dieser Seite benutzt werden. Er dient hauptsächlich administrativen Aufgaben und bietet die Möglichkeit, den XML-Code aufzuräumen wenn ein Fehler auf dieser Seite auftritt.

# outline_status_cleanall.description
source: [FILL IN]Why is my XML dirty and why do I want to clean it up?
de: [AUSFÜLLEN] Warum ist mein XML-Code unordentlich und warum sollte ich ihn aufräumen?
