Repository: T3Voila/templavoilaplus
Catalog: Resources/Private/Language/*.locallang_csh_to.xlf
Languages: de

# .description
source: The Template Object maps a predefined data structure with an actual HTML template. It thus allows you to define when
de: Das Vorlagenobjekt verknüpft eine vordefinierte Datenstruktur mit einer HTML-Vorlage. Dadurch erlaubt es Ihnen zu definieren wann

# title.description
source: Enter a title that describes this Template Object.
de: Geben Sie einen beschreibenden Titel für das Vorlagenobjekt ein.

# datastructure.description
source: Select a data structure that this Template Object makes use of.
de: Wählen Sie eine zu verwendende Datenstruktur für dieses Vorlagenobjekt.

# fileref.description
source: Choose a HTML template as a basis for the mapping.
de: Wählen Sie eine HTML-Vorlage als Basis für die Verknüpfung.

# templatemapping.description
source: This data holds all information needed for TemplaVoilà to map the data structure to the actual HTML template file.
de: Diese Daten enthalten alle Informationen für TemplaVoilà um eine Datenstruktur mit einer HTML-Vorlagendatei zu verknüpfen.

# previewicon.description
source: Select a preview image to this Template Structure to
de: Wählen Sie ein Vorschaubild für diese Vorlagenstruktur um

# description.description
source: Add a small description that is used in the wizards to help users distinguish your templates.
de: Fügen Sie eine kurze Beschreibung für die Verwendung in Assistenten hinzu, welche Benutzern hilft Ihre Vorlagen zu unterscheiden.

# rendertype.description
source: Select whether this is a special Template Object, used for print or other uses, or for the default page.
de: Wählen Sie ob dies ein besonderes Vorlagen-Objekt, z.B. zur Verwendung für eine Druckansicht, oder für eine normale Seite ist.

# sys_language_uid.description
source: Select the language where this template object is applicable.
de: Wählen Sie die Sprache, für die dieses Vorlagen-Objekt anwendbar ist.

# parent.description
source: If this template object is a sub-template object, select a parent where the defaults should be inherited.
de: Wenn dieses Vorlagen-Objekt eine Untervorlage ist, wählen Sie das Eltern-Objekt von dem die Standardeinstellungen übernommen werden sollen.

# localprocessing.description
source: You can override the processing of fields defined in the data structure. For example, if you have an image field in your data structure, it will have TypoScript with defined maxW and maxH. You can override them here.
de: Sie können die Verarbeitung der in der Datenstruktur definierten Felder überschreiben. Beispielsweise besitzt ein Bild-Feld in der Datenstruktur TypoScript-Einstellungen für maxW und maxH, welche hier angepasst werden können.
